DataProcessors/ОргСхема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ОргСхема</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ТипТерминалаОргСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипТерминалаОргСхемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Учредитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководящийСостав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Департамент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отдел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Секция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сектор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сотрудник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_ВариантыОформленияДепартаментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ВариантыОформленияДепартаментов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СлитноСОтделами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отдельно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/КСУ_ВидОргсхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>КСУ_ВидОргсхемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>VC</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EM</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ОргСхема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ОргСхема</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязанности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТерминала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипТерминалаОргСхемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шрифт</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоднятьВверх</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВСхеме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляОргсхемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСтатистик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_НастройкиРабочегоСтолаСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотографии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЗаголовка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЦКП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логотип</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлятьОЗаполненииСтатистик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_УведомленияОЗаполненииСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВложеннаяОргсхема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаВложеннуюОргсхему</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДолжности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Статистики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статистика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ОргСхема/Forms/ФормаВыводаБлокаУпр/Ext/Form/Module.bsl
&НаКлиенте 
Перем ФиксСтруктура Экспорт;

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	МассивНарисОбъектов = Новый Массив;
	МассивНарисОбъектов.Добавить(ФиксСтруктура.Департамент);
	
	ИА_ОргСхема_Клиент.ПостроитьОС(ФиксСтруктура.Организация, БлокОргСхемы, МассивНарисОбъектов);
	
	Элементы.БлокОргСхемы.Заголовок = ИА_КСУОбщийСервер.ПолучитьЗначениеРеквизита(ФиксСтруктура.Департамент, "Наименование");
							
	// 0.7 это 70% от реальной ширины при отображении отдельно	
	Ширина = ИА_КСУОбщийСервер.ПолучитьЗначениеРеквизита(ФиксСтруктура.Департамент, "Ширина");
	ДельтаШирины = ?(ОформлениеОтдельно и не типЭМ, ФиксСтруктура.Ширина - ФиксСтруктура.Ширина * 0.7 , 0);
	Корректировка = ФиксСтруктура.Ширина * 0.02;  // используем для корректировки погрешности после запятой
	
	ПараметрыБлока = Новый Структура("Лево, Право, Потолок, Ширина",
						ФиксСтруктура.Лево - Цел(ДельтаШирины / 2) - Корректировка,
						ФиксСтруктура.Ширина + ФиксСтруктура.Лево + ДельтаШирины / 2 + Корректировка,
						ФиксСтруктура.Верх,
						ФиксСтруктура.Ширина + ДельтаШирины);
	
	СформироватьБлок(ФиксСтруктура.Департамент, ПараметрыБлока);
	
	БлокОргСхемы.АвтоМасштаб=Истина;
	
	
КонецПроцедуры


// Формирует отдельный блок из всей оргсхемы, а все остальное отсекает.
// Оставшиеся блоки позиционируются в начало таб. документа
//
&НаСервере
Процедура СформироватьБлок(Терминал, ПараметрыБлока)

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОргСхема.Ссылка
	                      |ИЗ
	                      |	Справочник.ОргСхема КАК ОргСхема
	                      |ГДЕ
	                      |	ОргСхема.ПометкаУдаления = ЛОЖЬ
	                      |	И ОргСхема.Ссылка В ИЕРАРХИИ(&Терминал)");
	Запрос.УстановитьПараметр("Терминал", Терминал.Ссылка);
	
	тз = Запрос.Выполнить().Выгрузить();
	
	КоличествоРисунков = БлокОргСхемы.Рисунки.Количество() - 1;
	
	НовыйПотолокРазница = ПараметрыБлока.Потолок - 2;
	НовыйЛевоРазница = ПараметрыБлока.Лево - 2;	
	
	МаксНиз = 0;
	ВерхБлокаЦКПОтдела = 0;
	
	Пока КоличествоРисунков >= 0 Цикл	
		
		Рисунок = БлокОргСхемы.Рисунки.Получить(КоличествоРисунков);
		ТекЛево = Рисунок.Лево;
		ТекПраво = Рисунок.Ширина + ТекЛево;
		ТекПотолок = Рисунок.Верх;
		
		СтрПоиска = тз.Найти(Рисунок.Расшифровка, "Ссылка");
		
		// Проверяем блок на принадлежность родителю и его положение 
		Если СтрПоиска = Неопределено
			И (ТекЛево < ПараметрыБлока.Лево 
			Или ТекПраво > ПараметрыБлока.Право 
			Или ТекПотолок < ПараметрыБлока.Потолок) Тогда
			
			БлокОргСхемы.Рисунки.Удалить(Рисунок);
			
		Иначе 
			Рисунок.Лево = Рисунок.Лево - НовыйЛевоРазница;
			Рисунок.Верх = Рисунок.Верх - НовыйПотолокРазница;
			
			Если ЗначениеЗаполнено(Рисунок.Расшифровка) и (Рисунок.Расшифровка.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Секция ИЛИ Рисунок.Расшифровка.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Сотрудник) ТОгда
				низ = Рисунок.Верх + Рисунок.Высота;
				МаксНиз = Макс(МаксНиз, низ);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Рисунок.Расшифровка) и (Рисунок.Расшифровка.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Отдел) ТОгда
				ВерхБлокаЦКПОтдела = Макс(ВерхБлокаЦКПОтдела, Рисунок.Верх);
			КонецЕсли;
						
		КонецЕсли;
		
		КоличествоРисунков = КоличествоРисунков - 1;
		
	КонецЦикла;
	
	ШиринаОблПечати = 0;
	ВысотаОблПечати = 0;
	
	// поднимем заливку
	КоличествоРисунков = БлокОргСхемы.Рисунки.Количество() - 1;
	
	//Доп условие для случая слабо заполненного департамента
	Для Сч = 0 По КоличествоРисунков Цикл
		Рисунок = БлокОргСхемы.Рисунки.Получить(Сч);
		Если ЗначениеЗаполнено(Рисунок.Расшифровка) 
			И (Рисунок.Расшифровка.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Департамент
			ИЛИ Рисунок.Расшифровка.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Отдел) Тогда 
			низ = Рисунок.Верх + Рисунок.Высота;
			МаксНиз = Макс(МаксНиз, низ);
		Иначе
			Прервать;//Не нужно проверять остальные терминалы и ЦКП Департамента
		КонецЕсли;
	КонецЦикла;
	//
	
	Дельта = ВерхБлокаЦКПОтдела - МаксНиз;
	
	Для Сч = 0 По КоличествоРисунков Цикл
		Рисунок = БлокОргСхемы.Рисунки.Получить(Сч);
		низ = Рисунок.Верх + Рисунок.Высота;
		Если низ > МаксНиз Тогда
			Если не ЗначениеЗаполнено(Рисунок.Расшифровка) Тогда // это заливка
				Рисунок.Высота = МаксНиз - Рисунок.Верх;
			иначе // это блоки цкп
				Рисунок.Верх = Рисунок.Верх - Дельта + 1; 
				
				Если Рисунок.Расшифровка = Терминал Тогда
					ШиринаОблПечати =  (Рисунок.Лево +Рисунок.Ширина) / 1.85;
					ВысотаОблПечати =  (Рисунок.Верх +Рисунок.Высота)  * 2.89;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// настроим область печати
	КолКолонок = ШиринаОблПечати / 9;
	Если КолКолонок>цел(КолКолонок) Тогда
		КолКолонок = цел(КолКолонок) + 1;
	Иначе
		КолКолонок = цел(КолКолонок);
	КонецЕсли;
	
	КолСтрок = ВысотаОблПечати / 11;
	Если КолСтрок>цел(КолСтрок) Тогда
		КолСтрок = цел(КолСтрок) + 1;
	Иначе
		КолСтрок = цел(КолСтрок);
	КонецЕсли;
	
	БлокОргСхемы.ОбластьПечати = БлокОргСхемы.Область("R1C1:R"+КолСтрок+"C"+КолКолонок);
КонецПроцедуры
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОформлениеОтдельно = Константы.ИА_ВариантыОформленияДепартаментов.Получить() = Перечисления.ИА_ВариантыОформленияДепартаментов.Отдельно;	
	типЭМ = Константы.КСУ_ВидОргсхемы.Получить() = Перечисления.КСУ_ВидОргсхемы.EM;
КонецПроцедуры
